{"format": "graph-model", "generatedBy": "2.17.0", "convertedBy": "TensorFlow.js Converter v4.21.0", "signature": {"inputs": {"onnx____Reshape_0": {"name": "onnx____reshape_0:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "17"}, {"size": "2"}, {"size": "243"}]}}}, "outputs": {"158": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "17"}, {"size": "3"}]}}}}, "modelTopology": {"node": [{"name": "unknown_23", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT64", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT64"}}}, {"name": "unknown_24", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT64", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT64"}}}, {"name": "PartitionedCall/model_4/tf.strided_slice_3/StridedSlice/strides", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT64", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT64"}}}, {"name": "unknown_17", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT64", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT64"}}}, {"name": "unknown_18", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT64", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT64"}}}, {"name": "PartitionedCall/model_4/tf.strided_slice_2/StridedSlice/strides", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT64", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT64"}}}, {"name": "unknown_11", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT64", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT64"}}}, {"name": "unknown_12", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT64", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT64"}}}, {"name": "PartitionedCall/model_4/tf.strided_slice_1/StridedSlice/strides", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT64", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT64"}}}, {"name": "unknown_5", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT64", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT64"}}}, {"name": "unknown_6", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT64", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT64"}}}, {"name": "PartitionedCall/model_4/tf.strided_slice/StridedSlice/strides", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT64", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT64"}}}, {"name": "PartitionedCall/model_4/tf.compat.v1.transpose_2/transpose/perm", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/model_4/tf.reshape_2/Reshape/shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/model_4/tf.compat.v1.nn.conv1d/conv1d/ExpandDims/dim", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/model_4/tf.compat.v1.nn.conv1d/conv1d/ExpandDims_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "3"}, {"size": "34"}, {"size": "1024"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_0", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1024"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_4/tf.space_to_batch_nd/SpaceToBatchND/block_shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/model_4/tf.space_to_batch_nd/SpaceToBatchND/paddings", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}, {"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/model_4/tf.compat.v1.nn.conv1d_1/conv1d/ExpandDims/dim", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/model_4/tf.compat.v1.nn.conv1d_1/conv1d/ExpandDims_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "3"}, {"size": "1024"}, {"size": "1024"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_4/tf.compat.v1.batch_to_space_nd/BatchToSpaceND/block_shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/model_4/tf.compat.v1.batch_to_space_nd/BatchToSpaceND/crops", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}, {"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "unknown_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1024"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_4/tf.compat.v1.nn.conv1d_2/conv1d/ExpandDims/dim", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/model_4/tf.compat.v1.nn.conv1d_2/conv1d/ExpandDims_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "1024"}, {"size": "1024"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_4", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1024"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_4/tf.space_to_batch_nd_1/SpaceToBatchND/block_shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/model_4/tf.space_to_batch_nd_1/SpaceToBatchND/paddings", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}, {"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/model_4/tf.compat.v1.nn.conv1d_3/conv1d/ExpandDims/dim", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/model_4/tf.compat.v1.nn.conv1d_3/conv1d/ExpandDims_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "3"}, {"size": "1024"}, {"size": "1024"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_4/tf.compat.v1.batch_to_space_nd_1/BatchToSpaceND/block_shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/model_4/tf.compat.v1.batch_to_space_nd_1/BatchToSpaceND/crops", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}, {"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "unknown_8", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1024"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_4/tf.compat.v1.nn.conv1d_4/conv1d/ExpandDims/dim", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/model_4/tf.compat.v1.nn.conv1d_4/conv1d/ExpandDims_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "1024"}, {"size": "1024"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_10", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1024"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_4/tf.space_to_batch_nd_2/SpaceToBatchND/block_shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/model_4/tf.space_to_batch_nd_2/SpaceToBatchND/paddings", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}, {"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/model_4/tf.compat.v1.nn.conv1d_5/conv1d/ExpandDims/dim", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/model_4/tf.compat.v1.nn.conv1d_5/conv1d/ExpandDims_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "3"}, {"size": "1024"}, {"size": "1024"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_4/tf.compat.v1.batch_to_space_nd_2/BatchToSpaceND/block_shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/model_4/tf.compat.v1.batch_to_space_nd_2/BatchToSpaceND/crops", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}, {"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "unknown_14", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1024"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_4/tf.compat.v1.nn.conv1d_6/conv1d/ExpandDims/dim", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/model_4/tf.compat.v1.nn.conv1d_6/conv1d/ExpandDims_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "1024"}, {"size": "1024"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_16", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1024"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_4/tf.space_to_batch_nd_3/SpaceToBatchND/block_shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/model_4/tf.space_to_batch_nd_3/SpaceToBatchND/paddings", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}, {"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/model_4/tf.compat.v1.nn.conv1d_7/conv1d/ExpandDims/dim", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/model_4/tf.compat.v1.nn.conv1d_7/conv1d/ExpandDims_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "3"}, {"size": "1024"}, {"size": "1024"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_4/tf.compat.v1.batch_to_space_nd_3/BatchToSpaceND/block_shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/model_4/tf.compat.v1.batch_to_space_nd_3/BatchToSpaceND/crops", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}, {"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "unknown_20", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1024"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_4/tf.compat.v1.nn.conv1d_8/conv1d/ExpandDims/dim", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/model_4/tf.compat.v1.nn.conv1d_8/conv1d/ExpandDims_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "1024"}, {"size": "1024"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_22", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1024"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_4/tf.compat.v1.nn.conv1d_9/conv1d/ExpandDims/dim", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/model_4/tf.compat.v1.nn.conv1d_9/conv1d/ExpandDims_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "1024"}, {"size": "51"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_26", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "51"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_4/158/Reshape/shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "onnx____reshape_0", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "1"}, {"size": "17"}, {"size": "2"}, {"size": "243"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_4/tf.compat.v1.transpose_2/transpose", "op": "Transpose", "input": ["onnx____reshape_0", "PartitionedCall/model_4/tf.compat.v1.transpose_2/transpose/perm"], "attr": {"Tperm": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_4/tf.reshape_2/Reshape", "op": "Reshape", "input": ["PartitionedCall/model_4/tf.compat.v1.transpose_2/transpose", "PartitionedCall/model_4/tf.reshape_2/Reshape/shape"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/model_4/tf.compat.v1.nn.conv1d/conv1d/ExpandDims", "op": "ExpandDims", "input": ["PartitionedCall/model_4/tf.reshape_2/Reshape", "PartitionedCall/model_4/tf.compat.v1.nn.conv1d/conv1d/ExpandDims/dim"], "attr": {"Tdim": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_4/tf.compat.v1.nn.conv1d/conv1d", "op": "Conv2D", "input": ["PartitionedCall/model_4/tf.compat.v1.nn.conv1d/conv1d/ExpandDims", "PartitionedCall/model_4/tf.compat.v1.nn.conv1d/conv1d/ExpandDims_1"], "device": "/device:CPU:0", "attr": {"padding": {"s": "VkFMSUQ="}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "PartitionedCall/model_4/tf.compat.v1.nn.conv1d/conv1d/Squeeze", "op": "Squeeze", "input": ["PartitionedCall/model_4/tf.compat.v1.nn.conv1d/conv1d"], "attr": {"T": {"type": "DT_FLOAT"}, "squeeze_dims": {"list": {"i": ["-3"]}}}}, {"name": "PartitionedCall/model_4/tf.math.add/Add", "op": "AddV2", "input": ["PartitionedCall/model_4/tf.compat.v1.nn.conv1d/conv1d/Squeeze", "unknown_0"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_4/tf.nn.relu/Relu", "op": "Relu", "input": ["PartitionedCall/model_4/tf.math.add/Add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_4/tf.strided_slice/StridedSlice", "op": "StridedSlice", "input": ["PartitionedCall/model_4/tf.nn.relu/Relu", "unknown_5", "unknown_6", "PartitionedCall/model_4/tf.strided_slice/StridedSlice/strides"], "attr": {"shrink_axis_mask": {"i": "0"}, "Index": {"type": "DT_INT64"}, "new_axis_mask": {"i": "0"}, "begin_mask": {"i": "5"}, "end_mask": {"i": "5"}, "T": {"type": "DT_FLOAT"}, "ellipsis_mask": {"i": "0"}}}, {"name": "PartitionedCall/model_4/tf.space_to_batch_nd/SpaceToBatchND", "op": "SpaceToBatchND", "input": ["PartitionedCall/model_4/tf.nn.relu/Relu", "PartitionedCall/model_4/tf.space_to_batch_nd/SpaceToBatchND/block_shape", "PartitionedCall/model_4/tf.space_to_batch_nd/SpaceToBatchND/paddings"], "attr": {"Tblock_shape": {"type": "DT_INT32"}, "Tpaddings": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_4/tf.compat.v1.nn.conv1d_1/conv1d/ExpandDims", "op": "ExpandDims", "input": ["PartitionedCall/model_4/tf.space_to_batch_nd/SpaceToBatchND", "PartitionedCall/model_4/tf.compat.v1.nn.conv1d_1/conv1d/ExpandDims/dim"], "attr": {"Tdim": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_4/tf.compat.v1.nn.conv1d_1/conv1d", "op": "Conv2D", "input": ["PartitionedCall/model_4/tf.compat.v1.nn.conv1d_1/conv1d/ExpandDims", "PartitionedCall/model_4/tf.compat.v1.nn.conv1d_1/conv1d/ExpandDims_1"], "device": "/device:CPU:0", "attr": {"padding": {"s": "VkFMSUQ="}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "PartitionedCall/model_4/tf.compat.v1.nn.conv1d_1/conv1d/Squeeze", "op": "Squeeze", "input": ["PartitionedCall/model_4/tf.compat.v1.nn.conv1d_1/conv1d"], "attr": {"T": {"type": "DT_FLOAT"}, "squeeze_dims": {"list": {"i": ["-3"]}}}}, {"name": "PartitionedCall/model_4/tf.compat.v1.batch_to_space_nd/BatchToSpaceND", "op": "BatchToSpaceND", "input": ["PartitionedCall/model_4/tf.compat.v1.nn.conv1d_1/conv1d/Squeeze", "PartitionedCall/model_4/tf.compat.v1.batch_to_space_nd/BatchToSpaceND/block_shape", "PartitionedCall/model_4/tf.compat.v1.batch_to_space_nd/BatchToSpaceND/crops"], "attr": {"Tblock_shape": {"type": "DT_INT32"}, "Tcrops": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_4/tf.math.add_1/Add", "op": "AddV2", "input": ["PartitionedCall/model_4/tf.compat.v1.batch_to_space_nd/BatchToSpaceND", "unknown_2"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_4/tf.nn.relu_1/Relu", "op": "Relu", "input": ["PartitionedCall/model_4/tf.math.add_1/Add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_4/tf.compat.v1.nn.conv1d_2/conv1d/ExpandDims", "op": "ExpandDims", "input": ["PartitionedCall/model_4/tf.nn.relu_1/Relu", "PartitionedCall/model_4/tf.compat.v1.nn.conv1d_2/conv1d/ExpandDims/dim"], "attr": {"Tdim": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_4/tf.compat.v1.nn.conv1d_2/conv1d", "op": "Conv2D", "input": ["PartitionedCall/model_4/tf.compat.v1.nn.conv1d_2/conv1d/ExpandDims", "PartitionedCall/model_4/tf.compat.v1.nn.conv1d_2/conv1d/ExpandDims_1"], "device": "/device:CPU:0", "attr": {"padding": {"s": "U0FNRQ=="}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "PartitionedCall/model_4/tf.compat.v1.nn.conv1d_2/conv1d/Squeeze", "op": "Squeeze", "input": ["PartitionedCall/model_4/tf.compat.v1.nn.conv1d_2/conv1d"], "attr": {"T": {"type": "DT_FLOAT"}, "squeeze_dims": {"list": {"i": ["-3"]}}}}, {"name": "PartitionedCall/model_4/tf.math.add_2/Add", "op": "AddV2", "input": ["PartitionedCall/model_4/tf.compat.v1.nn.conv1d_2/conv1d/Squeeze", "unknown_4"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_4/tf.nn.relu_2/Relu", "op": "Relu", "input": ["PartitionedCall/model_4/tf.math.add_2/Add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_4/tf.math.add_3/Add", "op": "AddV2", "input": ["PartitionedCall/model_4/tf.strided_slice/StridedSlice", "PartitionedCall/model_4/tf.nn.relu_2/Relu"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_4/tf.strided_slice_1/StridedSlice", "op": "StridedSlice", "input": ["PartitionedCall/model_4/tf.math.add_3/Add", "unknown_11", "unknown_12", "PartitionedCall/model_4/tf.strided_slice_1/StridedSlice/strides"], "attr": {"shrink_axis_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "Index": {"type": "DT_INT64"}, "begin_mask": {"i": "5"}, "T": {"type": "DT_FLOAT"}, "end_mask": {"i": "5"}, "ellipsis_mask": {"i": "0"}}}, {"name": "PartitionedCall/model_4/tf.space_to_batch_nd_1/SpaceToBatchND", "op": "SpaceToBatchND", "input": ["PartitionedCall/model_4/tf.math.add_3/Add", "PartitionedCall/model_4/tf.space_to_batch_nd_1/SpaceToBatchND/block_shape", "PartitionedCall/model_4/tf.space_to_batch_nd_1/SpaceToBatchND/paddings"], "attr": {"Tblock_shape": {"type": "DT_INT32"}, "Tpaddings": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_4/tf.compat.v1.nn.conv1d_3/conv1d/ExpandDims", "op": "ExpandDims", "input": ["PartitionedCall/model_4/tf.space_to_batch_nd_1/SpaceToBatchND", "PartitionedCall/model_4/tf.compat.v1.nn.conv1d_3/conv1d/ExpandDims/dim"], "attr": {"Tdim": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_4/tf.compat.v1.nn.conv1d_3/conv1d", "op": "Conv2D", "input": ["PartitionedCall/model_4/tf.compat.v1.nn.conv1d_3/conv1d/ExpandDims", "PartitionedCall/model_4/tf.compat.v1.nn.conv1d_3/conv1d/ExpandDims_1"], "device": "/device:CPU:0", "attr": {"padding": {"s": "VkFMSUQ="}, "data_format": {"s": "TkhXQw=="}, "use_cudnn_on_gpu": {"b": true}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "PartitionedCall/model_4/tf.compat.v1.nn.conv1d_3/conv1d/Squeeze", "op": "Squeeze", "input": ["PartitionedCall/model_4/tf.compat.v1.nn.conv1d_3/conv1d"], "attr": {"T": {"type": "DT_FLOAT"}, "squeeze_dims": {"list": {"i": ["-3"]}}}}, {"name": "PartitionedCall/model_4/tf.compat.v1.batch_to_space_nd_1/BatchToSpaceND", "op": "BatchToSpaceND", "input": ["PartitionedCall/model_4/tf.compat.v1.nn.conv1d_3/conv1d/Squeeze", "PartitionedCall/model_4/tf.compat.v1.batch_to_space_nd_1/BatchToSpaceND/block_shape", "PartitionedCall/model_4/tf.compat.v1.batch_to_space_nd_1/BatchToSpaceND/crops"], "attr": {"Tblock_shape": {"type": "DT_INT32"}, "Tcrops": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_4/tf.math.add_4/Add", "op": "AddV2", "input": ["PartitionedCall/model_4/tf.compat.v1.batch_to_space_nd_1/BatchToSpaceND", "unknown_8"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_4/tf.nn.relu_3/Relu", "op": "Relu", "input": ["PartitionedCall/model_4/tf.math.add_4/Add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_4/tf.compat.v1.nn.conv1d_4/conv1d/ExpandDims", "op": "ExpandDims", "input": ["PartitionedCall/model_4/tf.nn.relu_3/Relu", "PartitionedCall/model_4/tf.compat.v1.nn.conv1d_4/conv1d/ExpandDims/dim"], "attr": {"Tdim": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_4/tf.compat.v1.nn.conv1d_4/conv1d", "op": "Conv2D", "input": ["PartitionedCall/model_4/tf.compat.v1.nn.conv1d_4/conv1d/ExpandDims", "PartitionedCall/model_4/tf.compat.v1.nn.conv1d_4/conv1d/ExpandDims_1"], "device": "/device:CPU:0", "attr": {"padding": {"s": "U0FNRQ=="}, "data_format": {"s": "TkhXQw=="}, "use_cudnn_on_gpu": {"b": true}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "PartitionedCall/model_4/tf.compat.v1.nn.conv1d_4/conv1d/Squeeze", "op": "Squeeze", "input": ["PartitionedCall/model_4/tf.compat.v1.nn.conv1d_4/conv1d"], "attr": {"T": {"type": "DT_FLOAT"}, "squeeze_dims": {"list": {"i": ["-3"]}}}}, {"name": "PartitionedCall/model_4/tf.math.add_5/Add", "op": "AddV2", "input": ["PartitionedCall/model_4/tf.compat.v1.nn.conv1d_4/conv1d/Squeeze", "unknown_10"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_4/tf.nn.relu_4/Relu", "op": "Relu", "input": ["PartitionedCall/model_4/tf.math.add_5/Add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_4/tf.math.add_6/Add", "op": "AddV2", "input": ["PartitionedCall/model_4/tf.strided_slice_1/StridedSlice", "PartitionedCall/model_4/tf.nn.relu_4/Relu"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_4/tf.strided_slice_2/StridedSlice", "op": "StridedSlice", "input": ["PartitionedCall/model_4/tf.math.add_6/Add", "unknown_17", "unknown_18", "PartitionedCall/model_4/tf.strided_slice_2/StridedSlice/strides"], "attr": {"shrink_axis_mask": {"i": "0"}, "Index": {"type": "DT_INT64"}, "new_axis_mask": {"i": "0"}, "begin_mask": {"i": "5"}, "end_mask": {"i": "5"}, "T": {"type": "DT_FLOAT"}, "ellipsis_mask": {"i": "0"}}}, {"name": "PartitionedCall/model_4/tf.space_to_batch_nd_2/SpaceToBatchND", "op": "SpaceToBatchND", "input": ["PartitionedCall/model_4/tf.math.add_6/Add", "PartitionedCall/model_4/tf.space_to_batch_nd_2/SpaceToBatchND/block_shape", "PartitionedCall/model_4/tf.space_to_batch_nd_2/SpaceToBatchND/paddings"], "attr": {"Tpaddings": {"type": "DT_INT32"}, "Tblock_shape": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_4/tf.compat.v1.nn.conv1d_5/conv1d/ExpandDims", "op": "ExpandDims", "input": ["PartitionedCall/model_4/tf.space_to_batch_nd_2/SpaceToBatchND", "PartitionedCall/model_4/tf.compat.v1.nn.conv1d_5/conv1d/ExpandDims/dim"], "attr": {"Tdim": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_4/tf.compat.v1.nn.conv1d_5/conv1d", "op": "Conv2D", "input": ["PartitionedCall/model_4/tf.compat.v1.nn.conv1d_5/conv1d/ExpandDims", "PartitionedCall/model_4/tf.compat.v1.nn.conv1d_5/conv1d/ExpandDims_1"], "device": "/device:CPU:0", "attr": {"padding": {"s": "VkFMSUQ="}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "PartitionedCall/model_4/tf.compat.v1.nn.conv1d_5/conv1d/Squeeze", "op": "Squeeze", "input": ["PartitionedCall/model_4/tf.compat.v1.nn.conv1d_5/conv1d"], "attr": {"T": {"type": "DT_FLOAT"}, "squeeze_dims": {"list": {"i": ["-3"]}}}}, {"name": "PartitionedCall/model_4/tf.compat.v1.batch_to_space_nd_2/BatchToSpaceND", "op": "BatchToSpaceND", "input": ["PartitionedCall/model_4/tf.compat.v1.nn.conv1d_5/conv1d/Squeeze", "PartitionedCall/model_4/tf.compat.v1.batch_to_space_nd_2/BatchToSpaceND/block_shape", "PartitionedCall/model_4/tf.compat.v1.batch_to_space_nd_2/BatchToSpaceND/crops"], "attr": {"Tblock_shape": {"type": "DT_INT32"}, "Tcrops": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_4/tf.math.add_7/Add", "op": "AddV2", "input": ["PartitionedCall/model_4/tf.compat.v1.batch_to_space_nd_2/BatchToSpaceND", "unknown_14"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_4/tf.nn.relu_5/Relu", "op": "Relu", "input": ["PartitionedCall/model_4/tf.math.add_7/Add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_4/tf.compat.v1.nn.conv1d_6/conv1d/ExpandDims", "op": "ExpandDims", "input": ["PartitionedCall/model_4/tf.nn.relu_5/Relu", "PartitionedCall/model_4/tf.compat.v1.nn.conv1d_6/conv1d/ExpandDims/dim"], "attr": {"Tdim": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_4/tf.compat.v1.nn.conv1d_6/conv1d", "op": "Conv2D", "input": ["PartitionedCall/model_4/tf.compat.v1.nn.conv1d_6/conv1d/ExpandDims", "PartitionedCall/model_4/tf.compat.v1.nn.conv1d_6/conv1d/ExpandDims_1"], "device": "/device:CPU:0", "attr": {"padding": {"s": "U0FNRQ=="}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "PartitionedCall/model_4/tf.compat.v1.nn.conv1d_6/conv1d/Squeeze", "op": "Squeeze", "input": ["PartitionedCall/model_4/tf.compat.v1.nn.conv1d_6/conv1d"], "attr": {"T": {"type": "DT_FLOAT"}, "squeeze_dims": {"list": {"i": ["-3"]}}}}, {"name": "PartitionedCall/model_4/tf.math.add_8/Add", "op": "AddV2", "input": ["PartitionedCall/model_4/tf.compat.v1.nn.conv1d_6/conv1d/Squeeze", "unknown_16"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_4/tf.nn.relu_6/Relu", "op": "Relu", "input": ["PartitionedCall/model_4/tf.math.add_8/Add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_4/tf.math.add_9/Add", "op": "AddV2", "input": ["PartitionedCall/model_4/tf.strided_slice_2/StridedSlice", "PartitionedCall/model_4/tf.nn.relu_6/Relu"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_4/tf.strided_slice_3/StridedSlice", "op": "StridedSlice", "input": ["PartitionedCall/model_4/tf.math.add_9/Add", "unknown_23", "unknown_24", "PartitionedCall/model_4/tf.strided_slice_3/StridedSlice/strides"], "attr": {"shrink_axis_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "Index": {"type": "DT_INT64"}, "begin_mask": {"i": "5"}, "end_mask": {"i": "5"}, "T": {"type": "DT_FLOAT"}, "ellipsis_mask": {"i": "0"}}}, {"name": "PartitionedCall/model_4/tf.space_to_batch_nd_3/SpaceToBatchND", "op": "SpaceToBatchND", "input": ["PartitionedCall/model_4/tf.math.add_9/Add", "PartitionedCall/model_4/tf.space_to_batch_nd_3/SpaceToBatchND/block_shape", "PartitionedCall/model_4/tf.space_to_batch_nd_3/SpaceToBatchND/paddings"], "attr": {"Tblock_shape": {"type": "DT_INT32"}, "Tpaddings": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_4/tf.compat.v1.nn.conv1d_7/conv1d/ExpandDims", "op": "ExpandDims", "input": ["PartitionedCall/model_4/tf.space_to_batch_nd_3/SpaceToBatchND", "PartitionedCall/model_4/tf.compat.v1.nn.conv1d_7/conv1d/ExpandDims/dim"], "attr": {"Tdim": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_4/tf.compat.v1.nn.conv1d_7/conv1d", "op": "Conv2D", "input": ["PartitionedCall/model_4/tf.compat.v1.nn.conv1d_7/conv1d/ExpandDims", "PartitionedCall/model_4/tf.compat.v1.nn.conv1d_7/conv1d/ExpandDims_1"], "device": "/device:CPU:0", "attr": {"padding": {"s": "VkFMSUQ="}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "PartitionedCall/model_4/tf.compat.v1.nn.conv1d_7/conv1d/Squeeze", "op": "Squeeze", "input": ["PartitionedCall/model_4/tf.compat.v1.nn.conv1d_7/conv1d"], "attr": {"T": {"type": "DT_FLOAT"}, "squeeze_dims": {"list": {"i": ["-3"]}}}}, {"name": "PartitionedCall/model_4/tf.compat.v1.batch_to_space_nd_3/BatchToSpaceND", "op": "BatchToSpaceND", "input": ["PartitionedCall/model_4/tf.compat.v1.nn.conv1d_7/conv1d/Squeeze", "PartitionedCall/model_4/tf.compat.v1.batch_to_space_nd_3/BatchToSpaceND/block_shape", "PartitionedCall/model_4/tf.compat.v1.batch_to_space_nd_3/BatchToSpaceND/crops"], "attr": {"Tblock_shape": {"type": "DT_INT32"}, "Tcrops": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_4/tf.math.add_10/Add", "op": "AddV2", "input": ["PartitionedCall/model_4/tf.compat.v1.batch_to_space_nd_3/BatchToSpaceND", "unknown_20"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_4/tf.nn.relu_7/Relu", "op": "Relu", "input": ["PartitionedCall/model_4/tf.math.add_10/Add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_4/tf.compat.v1.nn.conv1d_8/conv1d/ExpandDims", "op": "ExpandDims", "input": ["PartitionedCall/model_4/tf.nn.relu_7/Relu", "PartitionedCall/model_4/tf.compat.v1.nn.conv1d_8/conv1d/ExpandDims/dim"], "attr": {"Tdim": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_4/tf.compat.v1.nn.conv1d_8/conv1d", "op": "Conv2D", "input": ["PartitionedCall/model_4/tf.compat.v1.nn.conv1d_8/conv1d/ExpandDims", "PartitionedCall/model_4/tf.compat.v1.nn.conv1d_8/conv1d/ExpandDims_1"], "device": "/device:CPU:0", "attr": {"padding": {"s": "U0FNRQ=="}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "PartitionedCall/model_4/tf.compat.v1.nn.conv1d_8/conv1d/Squeeze", "op": "Squeeze", "input": ["PartitionedCall/model_4/tf.compat.v1.nn.conv1d_8/conv1d"], "attr": {"T": {"type": "DT_FLOAT"}, "squeeze_dims": {"list": {"i": ["-3"]}}}}, {"name": "PartitionedCall/model_4/tf.math.add_11/Add", "op": "AddV2", "input": ["PartitionedCall/model_4/tf.compat.v1.nn.conv1d_8/conv1d/Squeeze", "unknown_22"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_4/tf.nn.relu_8/Relu", "op": "Relu", "input": ["PartitionedCall/model_4/tf.math.add_11/Add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_4/tf.math.add_12/Add", "op": "AddV2", "input": ["PartitionedCall/model_4/tf.strided_slice_3/StridedSlice", "PartitionedCall/model_4/tf.nn.relu_8/Relu"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_4/tf.compat.v1.nn.conv1d_9/conv1d/ExpandDims", "op": "ExpandDims", "input": ["PartitionedCall/model_4/tf.math.add_12/Add", "PartitionedCall/model_4/tf.compat.v1.nn.conv1d_9/conv1d/ExpandDims/dim"], "attr": {"Tdim": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_4/tf.compat.v1.nn.conv1d_9/conv1d", "op": "Conv2D", "input": ["PartitionedCall/model_4/tf.compat.v1.nn.conv1d_9/conv1d/ExpandDims", "PartitionedCall/model_4/tf.compat.v1.nn.conv1d_9/conv1d/ExpandDims_1"], "device": "/device:CPU:0", "attr": {"padding": {"s": "U0FNRQ=="}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "PartitionedCall/model_4/tf.compat.v1.nn.conv1d_9/conv1d/Squeeze", "op": "Squeeze", "input": ["PartitionedCall/model_4/tf.compat.v1.nn.conv1d_9/conv1d"], "attr": {"T": {"type": "DT_FLOAT"}, "squeeze_dims": {"list": {"i": ["-3"]}}}}, {"name": "PartitionedCall/model_4/tf.math.add_13/Add", "op": "AddV2", "input": ["PartitionedCall/model_4/tf.compat.v1.nn.conv1d_9/conv1d/Squeeze", "unknown_26"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_4/158/Reshape", "op": "Reshape", "input": ["PartitionedCall/model_4/tf.math.add_13/Add", "PartitionedCall/model_4/158/Reshape/shape"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "Identity", "op": "Identity", "input": ["PartitionedCall/model_4/158/Reshape"], "attr": {"T": {"type": "DT_FLOAT"}}}], "library": {}, "versions": {"producer": 1882}}, "weightsManifest": [{"paths": ["group1-shard1of17.bin", "group1-shard2of17.bin", "group1-shard3of17.bin", "group1-shard4of17.bin", "group1-shard5of17.bin", "group1-shard6of17.bin", "group1-shard7of17.bin", "group1-shard8of17.bin", "group1-shard9of17.bin", "group1-shard10of17.bin", "group1-shard11of17.bin", "group1-shard12of17.bin", "group1-shard13of17.bin", "group1-shard14of17.bin", "group1-shard15of17.bin", "group1-shard16of17.bin", "group1-shard17of17.bin"], "weights": [{"name": "unknown_23", "shape": [3], "dtype": "int32"}, {"name": "unknown_24", "shape": [3], "dtype": "int32"}, {"name": "PartitionedCall/model_4/tf.strided_slice_3/StridedSlice/strides", "shape": [3], "dtype": "int32"}, {"name": "unknown_17", "shape": [3], "dtype": "int32"}, {"name": "unknown_18", "shape": [3], "dtype": "int32"}, {"name": "PartitionedCall/model_4/tf.strided_slice_2/StridedSlice/strides", "shape": [3], "dtype": "int32"}, {"name": "unknown_11", "shape": [3], "dtype": "int32"}, {"name": "unknown_12", "shape": [3], "dtype": "int32"}, {"name": "PartitionedCall/model_4/tf.strided_slice_1/StridedSlice/strides", "shape": [3], "dtype": "int32"}, {"name": "unknown_5", "shape": [3], "dtype": "int32"}, {"name": "unknown_6", "shape": [3], "dtype": "int32"}, {"name": "PartitionedCall/model_4/tf.strided_slice/StridedSlice/strides", "shape": [3], "dtype": "int32"}, {"name": "PartitionedCall/model_4/tf.compat.v1.transpose_2/transpose/perm", "shape": [4], "dtype": "int32"}, {"name": "PartitionedCall/model_4/tf.reshape_2/Reshape/shape", "shape": [3], "dtype": "int32"}, {"name": "PartitionedCall/model_4/tf.compat.v1.nn.conv1d/conv1d/ExpandDims/dim", "shape": [], "dtype": "int32"}, {"name": "PartitionedCall/model_4/tf.compat.v1.nn.conv1d/conv1d/ExpandDims_1", "shape": [1, 3, 34, 1024], "dtype": "float32"}, {"name": "unknown_0", "shape": [1024], "dtype": "float32"}, {"name": "PartitionedCall/model_4/tf.space_to_batch_nd/SpaceToBatchND/block_shape", "shape": [1], "dtype": "int32"}, {"name": "PartitionedCall/model_4/tf.space_to_batch_nd/SpaceToBatchND/paddings", "shape": [1, 2], "dtype": "int32"}, {"name": "PartitionedCall/model_4/tf.compat.v1.nn.conv1d_1/conv1d/ExpandDims/dim", "shape": [], "dtype": "int32"}, {"name": "PartitionedCall/model_4/tf.compat.v1.nn.conv1d_1/conv1d/ExpandDims_1", "shape": [1, 3, 1024, 1024], "dtype": "float32"}, {"name": "PartitionedCall/model_4/tf.compat.v1.batch_to_space_nd/BatchToSpaceND/block_shape", "shape": [1], "dtype": "int32"}, {"name": "PartitionedCall/model_4/tf.compat.v1.batch_to_space_nd/BatchToSpaceND/crops", "shape": [1, 2], "dtype": "int32"}, {"name": "unknown_2", "shape": [1024], "dtype": "float32"}, {"name": "PartitionedCall/model_4/tf.compat.v1.nn.conv1d_2/conv1d/ExpandDims/dim", "shape": [], "dtype": "int32"}, {"name": "PartitionedCall/model_4/tf.compat.v1.nn.conv1d_2/conv1d/ExpandDims_1", "shape": [1, 1, 1024, 1024], "dtype": "float32"}, {"name": "unknown_4", "shape": [1024], "dtype": "float32"}, {"name": "PartitionedCall/model_4/tf.space_to_batch_nd_1/SpaceToBatchND/block_shape", "shape": [1], "dtype": "int32"}, {"name": "PartitionedCall/model_4/tf.space_to_batch_nd_1/SpaceToBatchND/paddings", "shape": [1, 2], "dtype": "int32"}, {"name": "PartitionedCall/model_4/tf.compat.v1.nn.conv1d_3/conv1d/ExpandDims/dim", "shape": [], "dtype": "int32"}, {"name": "PartitionedCall/model_4/tf.compat.v1.nn.conv1d_3/conv1d/ExpandDims_1", "shape": [1, 3, 1024, 1024], "dtype": "float32"}, {"name": "PartitionedCall/model_4/tf.compat.v1.batch_to_space_nd_1/BatchToSpaceND/block_shape", "shape": [1], "dtype": "int32"}, {"name": "PartitionedCall/model_4/tf.compat.v1.batch_to_space_nd_1/BatchToSpaceND/crops", "shape": [1, 2], "dtype": "int32"}, {"name": "unknown_8", "shape": [1024], "dtype": "float32"}, {"name": "PartitionedCall/model_4/tf.compat.v1.nn.conv1d_4/conv1d/ExpandDims/dim", "shape": [], "dtype": "int32"}, {"name": "PartitionedCall/model_4/tf.compat.v1.nn.conv1d_4/conv1d/ExpandDims_1", "shape": [1, 1, 1024, 1024], "dtype": "float32"}, {"name": "unknown_10", "shape": [1024], "dtype": "float32"}, {"name": "PartitionedCall/model_4/tf.space_to_batch_nd_2/SpaceToBatchND/block_shape", "shape": [1], "dtype": "int32"}, {"name": "PartitionedCall/model_4/tf.space_to_batch_nd_2/SpaceToBatchND/paddings", "shape": [1, 2], "dtype": "int32"}, {"name": "PartitionedCall/model_4/tf.compat.v1.nn.conv1d_5/conv1d/ExpandDims/dim", "shape": [], "dtype": "int32"}, {"name": "PartitionedCall/model_4/tf.compat.v1.nn.conv1d_5/conv1d/ExpandDims_1", "shape": [1, 3, 1024, 1024], "dtype": "float32"}, {"name": "PartitionedCall/model_4/tf.compat.v1.batch_to_space_nd_2/BatchToSpaceND/block_shape", "shape": [1], "dtype": "int32"}, {"name": "PartitionedCall/model_4/tf.compat.v1.batch_to_space_nd_2/BatchToSpaceND/crops", "shape": [1, 2], "dtype": "int32"}, {"name": "unknown_14", "shape": [1024], "dtype": "float32"}, {"name": "PartitionedCall/model_4/tf.compat.v1.nn.conv1d_6/conv1d/ExpandDims/dim", "shape": [], "dtype": "int32"}, {"name": "PartitionedCall/model_4/tf.compat.v1.nn.conv1d_6/conv1d/ExpandDims_1", "shape": [1, 1, 1024, 1024], "dtype": "float32"}, {"name": "unknown_16", "shape": [1024], "dtype": "float32"}, {"name": "PartitionedCall/model_4/tf.space_to_batch_nd_3/SpaceToBatchND/block_shape", "shape": [1], "dtype": "int32"}, {"name": "PartitionedCall/model_4/tf.space_to_batch_nd_3/SpaceToBatchND/paddings", "shape": [1, 2], "dtype": "int32"}, {"name": "PartitionedCall/model_4/tf.compat.v1.nn.conv1d_7/conv1d/ExpandDims/dim", "shape": [], "dtype": "int32"}, {"name": "PartitionedCall/model_4/tf.compat.v1.nn.conv1d_7/conv1d/ExpandDims_1", "shape": [1, 3, 1024, 1024], "dtype": "float32"}, {"name": "PartitionedCall/model_4/tf.compat.v1.batch_to_space_nd_3/BatchToSpaceND/block_shape", "shape": [1], "dtype": "int32"}, {"name": "PartitionedCall/model_4/tf.compat.v1.batch_to_space_nd_3/BatchToSpaceND/crops", "shape": [1, 2], "dtype": "int32"}, {"name": "unknown_20", "shape": [1024], "dtype": "float32"}, {"name": "PartitionedCall/model_4/tf.compat.v1.nn.conv1d_8/conv1d/ExpandDims/dim", "shape": [], "dtype": "int32"}, {"name": "PartitionedCall/model_4/tf.compat.v1.nn.conv1d_8/conv1d/ExpandDims_1", "shape": [1, 1, 1024, 1024], "dtype": "float32"}, {"name": "unknown_22", "shape": [1024], "dtype": "float32"}, {"name": "PartitionedCall/model_4/tf.compat.v1.nn.conv1d_9/conv1d/ExpandDims/dim", "shape": [], "dtype": "int32"}, {"name": "PartitionedCall/model_4/tf.compat.v1.nn.conv1d_9/conv1d/ExpandDims_1", "shape": [1, 1, 1024, 51], "dtype": "float32"}, {"name": "unknown_26", "shape": [51], "dtype": "float32"}, {"name": "PartitionedCall/model_4/158/Reshape/shape", "shape": [4], "dtype": "int32"}]}]}